[
    {
        "id": "aboutMe"
        , "title": "About Me"
        , "bodyOfText": "<p>I have always had an interest in computer programming but it is only recently, at the age of 32, that I became fully commited to following programming as a career. To learn the basics I enrolled on a few online courses but most of my learning has taken place through figuring things out as I go along.</p><p>I originally studied Computing when I went to college, but in the second year I decided to apply for a job in a music shop (fancying myself as a bit of a musician!) and left the course. Five years later I returned to college to study Music Technology and received a BTEC National Diploma. I currently work at Royal Mail as an operational manager where I spend my days wishing I was doing something more inspiring. I'm adept at using MS Office programs (Excel is my favourite!) and I enjoy landscape photography in my spare time, processing my images with Photoshop. In all of the above, computers have been an important part of my life which is why I want to follow a career in IT.</p><p>I have set up an account on <a href='https://github.com/mthorning' target='_blank'>Github</a> where you can see some of the coding I have done, including the files for this site. Please have a look and <a href='#contactContainer'>contact me</a> with any questions or comments you may have.</p>"
    }
    , {
        "id": "aboutStackDesign"
        , "title": "About Stack Design"
        , "bodyOfText": "<p>I started Stack-Design as a means of educating myself and with the aim of acquiring some clients - I hope that the site will serve both as a professional portfolio for myself whilst at the same time advertising my services and helping my clients. The client area allows my customers to see the latest changes to their developing sites, message me with any comments or changes they would like to see and upload files for inclusion.</p><p>With very little in the way of overheads and keeping in mind that the work I do will serve me in the future as an example of my capabilities to future employers, I intend to keep my the costs for my services as low as possible.</p><p>It is vitally important with something such as computer programming that I practice often so that I do not lose the skills I have learnt. Stack-Design serves this purpose, I experiment with unfamiliar technologies on my on site and then apply my skills when creating sites for businesses who contact me with the desire to get themselves online.</p>"
    }
    , {
        "id": "services"
        , "title": "Services"
        , "bodyOfText": "<p>I can:<br /><ul><li>design fully responsive websites which look great on any device.</li><li>host your site for you.</li><li>set up and hire the domain name of your choice.</li><li>create email addresses for your site and set up email clients on your devices.</li><li>maintain your site, ensuring that there is always a backup should anything happen to the server.</li><li>manage your site, making amendments and additions as required.</li></ul></p><p>Unlike other companies I do not build your website using a content management system such as Wordpress or Drupal (although I can if this is what you would like!). Building my websites from the ground up means that I know exactly how they are put together, giving me total control over the look and functionality of the site.</p><p>Once the website is built I can give you the files and collect payment if that is all you want me to do. Alternatively, for a monthly fee I will host your website for you and take care of maintenance as well as making any additions or amendments that you wish as time goes on.</p><p>Please feel free to contact me with any questions, just click the contact button above. If you would prefer to talk than message then simply message me your phone number and I will call you back.</p>"
    }
]